const fs = require('fs');
// Read raw data
const fd = require('./v4_final.json');
const fil = require('./v4_filtered.json');
// Whitelist
const wl = new Set(['机器之心','量子位','新智元','极客公园','硅星人','智东西','馨金融','零壹财经','未央网','一本财经','十字财经','新金融洛书','独角金融','移动支付网','支付百科','消金界','第一消费金融','易鑫','金融数字化观察','轻金融','中国银行保险报','银行家杂志','愉见财经','零售银行','信贷风险管理','行长要参','支行长','银行科技研究社','银行青年','中国工商银行','中国建设银行','中国农业银行','中国银行','中国邮政储蓄银行','交通银行','招商银行','招商银行信用卡','兴业银行','中信银行','上海浦东发展银行','中原银行','宁波银行','盛京银行','蒙商银行','国家金融监督管理总局','央行发布','中国银行业杂志','中国金融四十人论坛','星图金融研究院','麦肯锡','波士顿咨询','金融论坛','第一财经','澎湃新闻','金融界','华尔�...
'